Revit 2026 API

# CompoundStructureCreateSimpleCompoundStructure Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CompoundStructure CreateSimpleCompoundStructure(
	IList<CompoundStructureLayer> layers
)
```
```vb
Public Shared Function CreateSimpleCompoundStructure (
	layers As IList(Of CompoundStructureLayer)
) As CompoundStructure
```
```cpp
public:
static CompoundStructure^ CreateSimpleCompoundStructure(
	IList<CompoundStructureLayer^>^ layers
)
```
```fsharp
static member CreateSimpleCompoundStructure :
        layers : IList<CompoundStructureLayer> -> CompoundStructure
```

#### Parameters

layers IListCompoundStructureLayer

#### Return Value

CompoundStructure

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace